// названия товаров
        let names = [];
        names[0] = "Папір офісний А4, 80 г/м2, 500 л";
        names[1] = "Біндери дл паперу 51 мм";
        names[2] = "Ручка кулькова синя";

        // цены на товар
        let prices = [];
        prices[0] = 280.25; // Папір офісний А4, 80 г/м2, 500 л
        prices[1] = 56;     // Біндери дл паперу 51 мм
        prices[2] = 12.50;  // Ручка кулькова синя

        let count = [];
        count[0] = +prompt("Скільки ви бажаєте придбати продукту 'Папір офісний А4, 80г/м2, 500л?'", 1)
        count[1] = +prompt("Скільки ви бажаєте придбати продукту 'Біндери дл паперу 51мм?'", 1)
        count[2] = +prompt("Скільки ви бажаєте придбати продукту 'Ручка кулькова синя?'", 1)
        // count[0] = 2;   // Папір офісний А4, 80 г/м2, 500 л
        // count[1] = 10;  // Біндери дл паперу 51 мм
        // count[2] = 10;  // Ручка кулькова синя
        let totalSum = 0;
        for(let i=0; i<count.length; i++){
            let sumProduct = prices[i]*count[i]
            totalSum+=sumProduct
            console.log(`Ви замовили ${names[i]} на суму ${sumProduct} гривень.`)
        }
        console.log(`Всього з вас ${totalSum} долларів.`)