alert("Рахуємо об'єм циліндру")
        let radius = +prompt("Введіть радіус циліндру. Бажано в сантиметрах)")
        let height = +prompt("Введіть висоту циліндру. Теж см, будь ласка")

        let V = Math.floor(Math.PI * Math.pow(radius, 2) * height)
        console.log(`Об'єм циліндру з радіусом ${radius}см і висотою ${height}см приблизно дорівнює ${V}см кубічних.`);
        //  V=π * r в квадраті * h
        // let V;
        // const Pi = 3.1415926535; // правильно використовувати константу для подібних значень
        // let r = 10; // радіус
        // let h = 20; // висота

        // V = Pi * r * r * h;
        // console.log(V);