        /* 
        Завдання: 
        Напишіть сценарії "Гра 'Вгадай число'". Суть гри – вгадати за меншу кількість спроб число, яке загадав сценарій. 
        Щоразу, коли гравець намагається вгадати число, сценарій виводить підказку - менше чи більше було загадано сценарієм. 
        Сценарій загадує число лише один раз на початку гри, і це число не змінюється до завершення гри. 
        Після завершення гри виведіть користувачеві інформацію про те, з якої спроби вгадано значення та скільки було витрачено на це час. 

        Для створення випадкового числа використовуйте наступний код: 
        let randomValue = Math.floor(Math.random() * 101); // випадкове значення від 0 до 100 буде записано в змінну randomValue 

        Приклад гри: 
        Сценарій: я загадав випадкове значення від 0 до 100 
        Користувач: 50 
        Сценарій: я загадав значення більше, ніж 50 
        Користувач: 75 
        Сценарій: я загадав значення менше, ніж 75 
        Користувач: 62 
        Сценарій: я загадав значення менше, ніж 62 
        Користувач: 56 
        Сценарій: Правильно! Загадане значення 56. Ви вгадали з 4-ї спроби за 10 сек. 
        */
       
        let randomValue = Math.floor(Math.random() * 101);
        let attemps = 0;
        let seconds = 0;
        let question;
        let message = 'Моє число знаходить в проміжку від нуля до сотні включно. Спробуй вгадати'
        let timer = setInterval(() => seconds++, 1000);
        do {
            question = +prompt(message);
            attemps++
            
            question > randomValue ? message = `Моє число менше ніж ${question}` : 
            message = `Моє число більше ніж ${question}`;
            console.log(timer);
        } while(question !=randomValue)            
        
        clearInterval(timer);
        alert(`Вітаю! Ви вгадали число ${randomValue} за ${attemps} спроб і ${seconds} секунд.`)