//створюємо змінну з ім'ям element і присвоюємо їй перший HTML елемент div, який буде знайдений в документі. 
        let element = document.querySelector("div");
        
        //"вішаємо" обробника на подію click (клік лівою клавішею миші). 
        //При кліці по HTML елементу, який знаходиться в змінній element буде запускатися функція-обробник.
        

        element.addEventListener('click', function(){
            element.innerText = 'Привіт світ!' // для HTML елементу, який знаходиться в змінній element змінюємо значення тексту, який знаходиться в елементі
        })